OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f707.h
#define C                       STATUSbits.C                    // bit 0
#define DC                      STATUSbits.DC                   // bit 1
#define Z                       STATUSbits.Z                    // bit 2
#define NOT_PD                  STATUSbits.NOT_PD               // bit 3
#define NOT_TO                  STATUSbits.NOT_TO               // bit 4
#define RP0                     STATUSbits.RP0                  // bit 5
#define RP1                     STATUSbits.RP1                  // bit 6
#define IRP                     STATUSbits.IRP                  // bit 7

#define TMR1ON                  T1CONbits.TMR1ON                // bit 0
#define NOT_T1SYNC              T1CONbits.NOT_T1SYNC            // bit 2, shadows bit in T1CONbits
#define T1SYNC                  T1CONbits.T1SYNC                // bit 2, shadows bit in T1CONbits
#define T1OSCEN                 T1CONbits.T1OSCEN               // bit 3
#define T1CKPS0                 T1CONbits.T1CKPS0               // bit 4
#define T1CKPS1                 T1CONbits.T1CKPS1               // bit 5
#define TMRCS0                  T1CONbits.TMRCS0                // bit 6, shadows bit in T1CONbits
#define TMR1CS0                 T1CONbits.TMR1CS0               // bit 6, shadows bit in T1CONbits
#define TMRCS1                  T1CONbits.TMRCS1                // bit 7, shadows bit in T1CONbits
#define TMR1CS1                 T1CONbits.TMR1CS1               // bit 7, shadows bit in T1CONbits

#define T1GSS0                  T1GCONbits.T1GSS0               // bit 0
#define T1GSS1                  T1GCONbits.T1GSS1               // bit 1
#define T1GVAL                  T1GCONbits.T1GVAL               // bit 2
#define T1GGO_NOT_DONE          T1GCONbits.T1GGO_NOT_DONE       // bit 3
#define T1GSPM                  T1GCONbits.T1GSPM               // bit 4
#define T1GTM                   T1GCONbits.T1GTM                // bit 5
#define T1GPOL                  T1GCONbits.T1GPOL               // bit 6
#define TMR1GE                  T1GCONbits.TMR1GE               // bit 7

#define T2CKPS0                 T2CONbits.T2CKPS0               // bit 0
#define T2CKPS1                 T2CONbits.T2CKPS1               // bit 1
#define TMR2ON                  T2CONbits.TMR2ON                // bit 2
#define TOUTPS0                 T2CONbits.TOUTPS0               // bit 3
#define TOUTPS1                 T2CONbits.TOUTPS1               // bit 4
#define TOUTPS2                 T2CONbits.TOUTPS2               // bit 5
#define TOUTPS3                 T2CONbits.TOUTPS3               // bit 6

#define TMR3ON                  T3CONbits.TMR3ON                // bit 0
#define T3SYNC                  T3CONbits.T3SYNC                // bit 2
#define T3CKPS0                 T3CONbits.T3CKPS0               // bit 4
#define T3CKPS1                 T3CONbits.T3CKPS1               // bit 5
#define TMR3CS0                 T3CONbits.TMR3CS0               // bit 6
#define TMR3CS1                 T3CONbits.TMR3CS1               // bit 7

#define T3GSS0                  T3GCONbits.T3GSS0               // bit 0
#define T3GSS1                  T3GCONbits.T3GSS1               // bit 1
#define T3GVAL                  T3GCONbits.T3GVAL               // bit 2
#define T3GGO_NOT_DONE          T3GCONbits.T3GGO_NOT_DONE       // bit 3
#define T3GSPM                  T3GCONbits.T3GSPM               // bit 4
#define T3GTM                   T3GCONbits.T3GTM                // bit 5
#define T3GPOL                  T3GCONbits.T3GPOL               // bit 6
#define TMR3GE                  T3GCONbits.TMR3GE               // bit 7

#define TAPS0                   TACONbits.TAPS0                 // bit 0, shadows bit in TACONbits
#define TMRAPS0                 TACONbits.TMRAPS0               // bit 0, shadows bit in TACONbits
#define TAPS1                   TACONbits.TAPS1                 // bit 1, shadows bit in TACONbits
#define TMRAPS1                 TACONbits.TMRAPS1               // bit 1, shadows bit in TACONbits
#define TAPS2                   TACONbits.TAPS2                 // bit 2, shadows bit in TACONbits
#define TMRAPS2                 TACONbits.TMRAPS2               // bit 2, shadows bit in TACONbits
#define TAPSA                   TACONbits.TAPSA                 // bit 3, shadows bit in TACONbits
#define TMRAPSA                 TACONbits.TMRAPSA               // bit 3, shadows bit in TACONbits
#define TASE                    TACONbits.TASE                  // bit 4, shadows bit in TACONbits
#define TMRASE                  TACONbits.TMRASE                // bit 4, shadows bit in TACONbits
#define TACS                    TACONbits.TACS                  // bit 5, shadows bit in TACONbits
#define TMRACS                  TACONbits.TMRACS                // bit 5, shadows bit in TACONbits
#define TMRAON                  TACONbits.TMRAON                // bit 7

#define TBPS0                   TBCONbits.TBPS0                 // bit 0, shadows bit in TBCONbits
#define TMRBPS0                 TBCONbits.TMRBPS0               // bit 0, shadows bit in TBCONbits
#define TBPS1                   TBCONbits.TBPS1                 // bit 1, shadows bit in TBCONbits
#define TMRBPS1                 TBCONbits.TMRBPS1               // bit 1, shadows bit in TBCONbits
#define TBPS2                   TBCONbits.TBPS2                 // bit 2, shadows bit in TBCONbits
#define TMRBPS2                 TBCONbits.TMRBPS2               // bit 2, shadows bit in TBCONbits
#define TBPSA                   TBCONbits.TBPSA                 // bit 3, shadows bit in TBCONbits
#define TMRBPSA                 TBCONbits.TMRBPSA               // bit 3, shadows bit in TBCONbits
#define TBSE                    TBCONbits.TBSE                  // bit 4, shadows bit in TBCONbits
#define TMRBSE                  TBCONbits.TMRBSE                // bit 4, shadows bit in TBCONbits
#define TBCS                    TBCONbits.TBCS                  // bit 5, shadows bit in TBCONbits
#define TMRBCS                  TBCONbits.TMRBCS                // bit 5, shadows bit in TBCONbits
#define TMRBON                  TBCONbits.TMRBON                // bit 7

#define TRISA0                  TRISAbits.TRISA0                // bit 0
#define TRISA1                  TRISAbits.TRISA1                // bit 1
#define TRISA2                  TRISAbits.TRISA2                // bit 2
#define TRISA3                  TRISAbits.TRISA3                // bit 3
#define TRISA4                  TRISAbits.TRISA4                // bit 4
#define TRISA5                  TRISAbits.TRISA5                // bit 5
#define TRISA6                  TRISAbits.TRISA6                // bit 6
#define TRISA7                  TRISAbits.TRISA7                // bit 7

#define TRISB0                  TRISBbits.TRISB0                // bit 0
#define TRISB1                  TRISBbits.TRISB1                // bit 1
#define TRISB2                  TRISBbits.TRISB2                // bit 2
#define TRISB3                  TRISBbits.TRISB3                // bit 3
#define TRISB4                  TRISBbits.TRISB4                // bit 4
#define TRISB5                  TRISBbits.TRISB5                // bit 5
#define TRISB6                  TRISBbits.TRISB6                // bit 6
#define TRISB7                  TRISBbits.TRISB7                // bit 7

